package homework19;
//Пользователь должен ввести с клавиатуры размер массива - натуральное число больше 3.
//Введенное пользователем число сохраняется в переменную n.
//Если пользователь ввёл не подходящее число, то программа должна просить пользователя повторить ввод.
//Создать массив из n случайных целых чисел из отрезка [0;n] и вывести его на экран.
//Создать второй массив только из чётных элементов первого массива, если они там есть, и вывести его на экран.

import lessons06.scanner.UserInput;

import java.util.Arrays;
//
//public class Task5 {
//    public static void main(String[] args) {
//
//        Task5Demo myArray = new Task5Demo();
//        int numberFromUser = myArray.getNumberfromUser();
//        System.out.println("Random array :");
//        int[] arrayFromRandomNumbers = myArray.createArray();
//        System.out.println(Arrays.toString(arrayFromRandomNumbers));
//        System.out.println("The same random array only with even numbers: ");
//        int[] arrayWithEvenNumbers = myArray.createArrayWithEvenNumbers();
//        System.out.println(Arrays.toString(arrayWithEvenNumbers));
//
//
//
//    }
//}