package homework14;

//1. Создать массив типа String с размером 7.
//2. Записать в него значения дней недели.
//3. Вывести на консоль значение последнего элемента.

public class task4 {
    public static void main(String[] args) {

        String[] weekDays ={"Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"};

        System.out.println("Last day of week is " + weekDays[6]);
    }
}
